ИБПрактика4/src/Documents/ПродажаНапитка/ПродажаНапитка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаНапитка</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиКофеен</registerRecords>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ЗаведенияСети</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.РаботникиКафе</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПродажи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЧека</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КофеИНапитки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИБПрактика4/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ЗаведенияСети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.КофеИНапитки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕденицаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИБПрактика4/src/AccumulationRegisters/ПродажиКофеен/ПродажиКофеен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиКофеен</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ЗаведенияСети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.РаботникиКафе</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.КофеИНапитки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПродажи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИБПрактика4/src/Documents/ПродажаНапитка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаНапиткаСоставЧека.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаНапиткаСоставЧека.Количество) КАК Количество,
		|	ПродажаНапиткаСоставЧека.Ссылка.ТорговаяТочка КАК ТорговаяТочка
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	Документ.ПродажаНапитка.СоставЧека КАК ПродажаНапиткаСоставЧека
		|ГДЕ
		|	ПродажаНапиткаСоставЧека.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаНапиткаСоставЧека.Номенклатура,
		|	ПродажаНапиткаСоставЧека.Ссылка.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура,
		|	втТЧТовары.Количество КАК Количество,
		|	втТЧТовары.Количество - ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Нехватка,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	втТЧТовары КАК втТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, ) КАК ОстаткиТоваровОстатки
		|		ПО втТЧТовары.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|			И втТЧТовары.ТорговаяТочка = ОстаткиТоваровОстатки.ТорговаяТочка
		|ГДЕ
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) <= втТЧТовары.Количество";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() <> 0 Тогда
		
		Отказ = Истина;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон("Товара %1 не хватает в количестве %2");
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Движения.ПродажиКофеен.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаНапиткаСоставЧека.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаНапиткаСоставЧека.Количество) КАК Количество
		|ИЗ
		|	Документ.ПродажаНапитка.СоставЧека КАК ПродажаНапиткаСоставЧека
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаНапиткаСоставЧека.Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// регистр ПродажиКофеен 
		Движение = Движения.ПродажиКофеен.Добавить();
		Движение.Период = Дата;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Сотрудник = Сотрудник;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.МетодОплаты = МетодОплаты;
		Движение.ДатаПродажи = Дата;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = Сумма;
		
		// регистр ОстаткиИнгредиентов Расход
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
	КонецЦикла;
	
КонецПроцедуры
